public_html/Embedded System/DM816x/Env Set Up.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Env Set up</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Env Set up"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-08-23 09:47:50 HKT"/>
<meta name="author" content="Shi Shougang"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="./assets/stylesheet.css" type="text/css"/>
<link rel="stylesheet" type="text/css" href="../../assets/stylesheet.css" />

</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="../../index.html"> UP </a>
 |
 <a accesskey="H" href="../../index.html"> HOME </a>
</div>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Env Set up</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Toolchain</a>
<ul>
<li><a href="#sec-1-1">Environment Setup</a></li>
</ul>
</li>
<li><a href="#sec-2">TFTP</a>
<ul>
<li><a href="#sec-2-1">step 1</a></li>
<li><a href="#sec-2-2">step 2</a></li>
<li><a href="#sec-2-3">step 3</a></li>
<li><a href="#sec-2-4">step 4</a></li>
</ul>
</li>
<li><a href="#sec-3">NFS</a>
<ul>
<li><a href="#sec-3-1">step 1</a></li>
<li><a href="#sec-3-2">step 2</a></li>
<li><a href="#sec-3-3">step 3</a></li>
<li><a href="#sec-3-4">step 4</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Toolchain</h2>
<div class="outline-text-2" id="text-1">

<p>CodeSourcery ARM tool chain version 2009-q1 <a href="https://sourcery.mentor.com/sgpp/portal/release858">https://sourcery.mentor.com/sgpp/portal/release858</a>
</p>

</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1">Environment Setup</h3>
<div class="outline-text-3" id="text-1-1">




<pre class="src src-sh">$ export <span style="color: #eedd82;">PATH</span>=/opt/toolchain/2009-q1/bin:$<span style="color: #eedd82;">PATH</span>
$ export <span style="color: #eedd82;">PATH</span>=/opt/u-boot/tools:$<span style="color: #eedd82;">PATH</span>
</pre>


</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">TFTP</h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1">step 1</h3>
<div class="outline-text-3" id="text-2-1">

<p>find the directory
</p>


<pre class="src src-sh"><span style="color: #eedd82;">tftproot</span>=<span style="color: #ffa07a;">"/tftpboot"</span>
sudo mkdir -p $<span style="color: #eedd82;">tftproot</span>
sudo chmod 777 $<span style="color: #eedd82;">tftproot</span>
sudo chown nobody $<span style="color: #eedd82;">tftproot</span>
</pre>


</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2">step 2</h3>
<div class="outline-text-3" id="text-2-2">

<p>copy the uimage to the folder
</p>


<pre class="src src-sh">sudo cp uimage $<span style="color: #eedd82;">tftproot</span>
</pre>


</div>

</div>

<div id="outline-container-2-3" class="outline-3">
<h3 id="sec-2-3">step 3</h3>
<div class="outline-text-3" id="text-2-3">

<p>create the file /etc/xinetd.d/tftp
</p>


<pre class="src src-sh"><span style="color: #87cefa;">tftp</span>() {
    <span style="color: #b0c4de;">echo</span> <span style="color: #ffa07a;">"</span>
<span style="color: #ffa07a;">service tftp</span>
<span style="color: #ffa07a;">{</span>
<span style="color: #ffa07a;">protocol = udp</span>
<span style="color: #ffa07a;">port = 69</span>
<span style="color: #ffa07a;">socket_type = dgram</span>
<span style="color: #ffa07a;">wait = yes</span>
<span style="color: #ffa07a;">user = nobody</span>
<span style="color: #ffa07a;">server = /usr/sbin/in.tftpd</span>
<span style="color: #ffa07a;">server_args = $tftproot</span>
<span style="color: #ffa07a;">disable = no</span>
<span style="color: #ffa07a;">}</span>
<span style="color: #ffa07a;">"</span> | sudo tee $<span style="color: #eedd82;">tftpcfg</span> &gt; /dev/null
}
</pre>


</div>

</div>

<div id="outline-container-2-4" class="outline-3">
<h3 id="sec-2-4">step 4</h3>
<div class="outline-text-3" id="text-2-4">

<p>start and stop the tftp server
</p>


<pre class="src src-sh">sudo /etc/init.d/xinetd stop

sudo /etc/init.d/xinetd start
</pre>



</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">NFS</h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1">step 1</h3>
<div class="outline-text-3" id="text-3-1">

<p>find the location
</p>



<pre class="src src-sh"><span style="color: #eedd82;">dst</span>=<span style="color: #ffa07a;">"${HOME}/targetfs"</span>
mkdir -p $<span style="color: #eedd82;">dst</span>
</pre>

</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2">step 2</h3>
<div class="outline-text-3" id="text-3-2">

<p>extract the filesystem
</p>



<pre class="src src-sh"><span style="color: #eedd82;">me</span>=<span style="color: #ffa07a;">'whoami'</span>
<span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">if exist the old filesystem, then sudo rm -rf $dst</span>
sudo tar xzf xxx.tar.gz -C $<span style="color: #eedd82;">dst</span>

sudo chown $<span style="color: #eedd82;">me</span>:$<span style="color: #eedd82;">me</span> $<span style="color: #eedd82;">dst</span>
sudo chown -R $<span style="color: #eedd82;">me</span>:$<span style="color: #eedd82;">me</span> $<span style="color: #eedd82;">dst</span>/home $<span style="color: #eedd82;">dst</span>/usr $<span style="color: #eedd82;">dst</span>/etc $<span style="color: #eedd82;">dst</span>/lib $<span style="color: #eedd82;">dst</span>/opt $<span style="color: #eedd82;">dst</span>/boot
</pre>


</div>

</div>

<div id="outline-container-3-3" class="outline-3">
<h3 id="sec-3-3">step 3</h3>
<div class="outline-text-3" id="text-3-3">

<p>export the target filesystem for NFS access
</p>


<pre class="src src-sh">sudo chmod 666 /etc/exports
sudo echo <span style="color: #ffa07a;">"$dst *(rw,nohide,insecure,no_subtree_check,async,no_root_squash)"</span> &gt;&gt; /etc/exports
sudo chmod 644 /etc/exports
</pre>


</div>

</div>

<div id="outline-container-3-4" class="outline-3">
<h3 id="sec-3-4">step 4</h3>
<div class="outline-text-3" id="text-3-4">

<p>start and stop the NFS server
</p>


<pre class="src src-sh">sudo /etc/init.d/nfs-kernel-server stop

sudo /etc/init.d/nfs-kernel-server start
</pre>

</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-08-23 09:47:50 HKT</p>
<p class="author">Author: Shi Shougang</p>
<p class="creator">Org version 7.8.09 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
